[
  {
    "toyId": 1, 
    "pictureURL": "https://i.ibb.co.com/3y4CX1jz/teddy.jpg",
    "toyName": "Giant Huggable Teddy Bear",
    "sellerName": "Fluffy Friends Co.",
    "sellerEmail": "fluffy@example.com",
    "price": 35.99,
    "rating": 4.8,
    "availableQuantity": 50,
    "description": "This magnificent teddy bear stands a towering 4 feet tall and is crafted from the softest, highest-quality plush material. It's perfect for cuddles, comforting, and makes an unforgettable gift. Its durable stitching ensures it can withstand years of loving hugs and adventures. An ideal companion for children of all ages, providing a sense of warmth and security.",
    "subCategory": "Plush Toys"
  },
  {
    "toyId": 2, 
    "pictureURL": "https://i.ibb.co.com/YTtdx7yF/car1.jpg",
    "toyName": "Remote Control Hyper-Speed Racer",
    "sellerName": "Speed Toys Inc.",
    "sellerEmail": "speedy@example.com",
    "price": 49.99,
    "rating": 4.7,
    "availableQuantity": 75,
    "description": "Experience the thrill of high-speed racing with this sleek, aerodynamic RC car. Equipped with powerful motors and all-terrain tires, it can reach blistering speeds on various surfaces. The controller provides precise steering and acceleration, making drifts and sharp turns easy. It features a rechargeable battery for extended playtime and brilliant LED headlights for racing at night.",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 3, 
    "pictureURL": "https://i.ibb.co.com/DDChLXKQ/Building-Blocks.jpg",
    "toyName": "150-Piece Creative Building Blocks Set",
    "sellerName": "Construct Wonders",
    "sellerEmail": "build@example.com",
    "price": 24.50,
    "rating": 4.9,
    "availableQuantity": 150,
    "description": "Unlock endless creativity with this expansive set of 150 non-toxic, interlocking building blocks. Featuring vibrant colors and various shapes, these blocks encourage spatial reasoning, fine motor skills, and imaginative play. The set includes a sturdy storage container for easy cleanup and a booklet with initial building ideas to spark young engineers' imaginations. Safe for toddlers and engaging for older kids.",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 4, 
    "pictureURL": "https://i.ibb.co.com/kVrKFCD9/Action-Figure.jpg",
    "toyName": "Articulated T-Rex Action Figure",
    "sellerName": "Dino World Toys",
    "sellerEmail": "dino@example.com",
    "price": 18.75,
    "rating": 4.6,
    "availableQuantity": 90,
    "description": "A highly detailed and realistically painted Tyrannosaurus Rex figure featuring multiple points of articulation, including the jaw, legs, and tail. Made from durable, child-safe plastic, this massive figure is ready for epic prehistoric battles and adventures. It stands firmly on its own and provides a great educational opportunity to learn about the Mesozoic era and its incredible creatures.",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 5, 
    "pictureURL": "https://i.ibb.co.com/wNmkYbm2/Kitchen-Set.jpg",
    "toyName": "Deluxe Wooden Play Kitchen Set",
    "sellerName": "Tiny Chef Toys",
    "sellerEmail": "chef@example.com",
    "price": 89.99,
    "rating": 5.0,
    "availableQuantity": 30,
    "description": "This beautifully crafted wooden kitchen set includes a stove, oven, sink, and several essential utensils. It promotes imaginative role-playing, teaching children about cooking and daily life in a safe, interactive environment. The durable, eco-friendly wood construction ensures longevity, and the realistic design, including clicking knobs and opening doors, makes playtime extra engaging. Assembly is simple with clear instructions.",
    "subCategory": "Educational Toys"
  },
  {
    "toyId": 6, 
    "pictureURL": "https://i.ibb.co.com/chq5Mpsg/Jigsaw-Puzzle.jpg",
    "toyName": "1000-Piece Galaxy Jigsaw Puzzle",
    "sellerName": "Brain Teaser Puzzles",
    "sellerEmail": "puzzle@example.com",
    "price": 19.99,
    "rating": 4.8,
    "availableQuantity": 120,
    "description": "Challenge your mind with this stunning 1000-piece puzzle featuring a high-definition image of a swirling nebula and distant galaxies. Each piece is uniquely shaped and made from high-quality, recycled cardboard with a non-glare finish. Completing this puzzle offers hours of relaxation and a beautiful, frame-worthy piece of art. It's an excellent activity for family bonding or solo focus.",
    "subCategory": "Puzzles"
  },
  {
    "toyId": 7, 
    "pictureURL": "https://i.ibb.co.com/BHmzYJZn/Train-Set-with-Tracks.jpg",
    "toyName": "Classic Electric Train Set with Tracks",
    "sellerName": "Rail Adventures",
    "sellerEmail": "rail@example.com",
    "price": 55.00,
    "rating": 4.5,
    "availableQuantity": 65,
    "description": "A timeless electric train set that brings the joy of model railroading to life. The set includes a classic steam engine, passenger cars, a freight car, and enough track pieces to build a complete oval layout. The engine features realistic sound effects, working headlights, and smoke (non-toxic vapor). It's easy to set up and provides a captivating display and interactive experience for collectors and children.",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 8, 
    "pictureURL": "https://i.ibb.co.com/4wMhyYnp/Dollhouse-Mansion.jpg",
    "toyName": "Three-Story Dream Dollhouse Mansion",
    "sellerName": "Dollhouse Dreams",
    "sellerEmail": "dollhouse@example.com",
    "price": 120.00,
    "rating": 4.9,
    "availableQuantity": 25,
    "description": "This massive, three-story wooden dollhouse provides a grand space for creative play. It features detailed wallpaper, open windows, a functional staircase, and seven spacious rooms ready for furniture and occupants. The sturdy construction ensures it will last for generations, becoming a treasured heirloom. It encourages storytelling, social play, and imaginative scenario development.",
    "subCategory": "Dolls & Accessories"
  },
  {
    "toyId": 9, 
    "pictureURL": "https://i.ibb.co.com/M03YXPK/Robot-Kit.jpg",
    "toyName": "Programmable Coding Robot Kit",
    "sellerName": "Code Kids Tech",
    "sellerEmail": "code@example.com",
    "price": 79.99,
    "rating": 4.7,
    "availableQuantity": 40,
    "description": "Introduce your child to the world of STEM and coding with this interactive robot kit. Using a simple block-based coding app, children can program the robot to move, light up, play sounds, and react to its environment. It's a fun and engaging way to teach logic, problem-solving, and computational thinking skills. No prior coding experience is required, making it perfect for beginners.",
    "subCategory": "STEM Toys"
  },
  {
    "toyId": 10, 
    "pictureURL": "https://i.ibb.co.com/21CJ9VCH/Art-Supplies-Case.jpg",
    "toyName": "Mega Art Supplies Case (150 Pieces)",
    "sellerName": "Creative Kids Supplies",
    "sellerEmail": "art@example.com",
    "price": 29.99,
    "rating": 4.5,
    "availableQuantity": 110,
    "description": "Unleash artistic talent with this complete 150-piece art set housed in a sleek wooden carrying case. The set includes watercolor paints, crayons, colored pencils, oil pastels, markers, and various brushes. It provides everything a young artist needs to explore different mediums, enhancing creativity and self-expression. It’s compact and portable for art creation anywhere.",
    "subCategory": "Creative Toys"
  },
  {
    "toyId": 11, 
    "pictureURL": "https://i.ibb.co.com/21CJ9VCH/Art-Supplies-Case.jpg",
    "toyName": "Die-Cast Fire Truck Model",
    "sellerName": "Urban Rescue Models",
    "sellerEmail": "rescue@example.com",
    "price": 22.00,
    "rating": 4.9,
    "availableQuantity": 85,
    "description": "A highly detailed, heavy-duty die-cast model of a classic fire ladder truck. It features working rubber wheels, an extendable and rotating ladder, and realistic markings. The durable metal construction ensures this model can handle rigorous play while maintaining its authentic look. Excellent for both collecting and imaginative emergency play scenarios.",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 12, 
    "pictureURL": "https://i.ibb.co.com/RXqcvW2/Unicorn-Plush.jpg",
    "toyName": "Rainbow Sparkle Unicorn Plush",
    "sellerName": "Mystical Softies",
    "sellerEmail": "unicorn@example.com",
    "price": 27.50,
    "rating": 4.7,
    "availableQuantity": 60,
    "description": "Meet the plush unicorn that brings magic to life! Covered in shimmering rainbow fur and featuring a glittery horn and mane, this soft toy is ready for fantastical adventures. It's perfectly sized for small hands to carry everywhere. Hypoallergenic material ensures safety for sensitive children. A beautiful and whimsical addition to any child's collection.",
    "subCategory": "Plush Toys"
  },
  {
    "toyId": 13, 
    "pictureURL": "https://i.ibb.co.com/qYSn4QfW/Space-Shuttle-Building-Kit.jpg",
    "toyName": "Modular Space Shuttle Building Kit",
    "sellerName": "Galaxy Constructors",
    "sellerEmail": "galaxy@example.com",
    "price": 65.99,
    "rating": 4.8,
    "availableQuantity": 45,
    "description": "An advanced building kit containing over 800 pieces to construct a realistic and modular space shuttle. The finished model features a detachable fuel tank, a functional cargo bay, and two astronaut minifigures. This challenging build promotes focus, detailed instruction-following, and a great sense of accomplishment upon completion. Ideal for older children and adult collectors.",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 14, 
    "pictureURL": "https://i.ibb.co.com/GvV5HydF/Transforming-Battle.jpg",
    "toyName": "Transforming Battle Mech Figure",
    "sellerName": "Cybertron Toys",
    "sellerEmail": "mech@example.com",
    "price": 28.00,
    "rating": 4.6,
    "availableQuantity": 70,
    "description": "This incredible action figure can transform from a fierce battle robot into a high-speed vehicle in ten easy steps! Made with durable joints and intricate detailing, it withstands rigorous play and encourages children to practice manual dexterity and creative transformation scenarios. A must-have for fans of sci-fi action and transforming toys.",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 15, 
    "pictureURL": "https://i.ibb.co.com/tTyFd9Xj/Drum-Set.jpg",
    "toyName": "Kids Deluxe 5-Piece Drum Set",
    "sellerName": "Rhythm Makers Inc.",
    "sellerEmail": "rhythm@example.com",
    "price": 75.00,
    "rating": 4.5,
    "availableQuantity": 35,
    "description": "A fully functional 5-piece junior drum set, including a bass drum, snare, two tom-toms, and a cymbal. It comes with a comfortable stool and drumsticks. This set is a fantastic way to introduce children to musical concepts, rhythm, and coordination. The robust construction is designed to handle enthusiastic young drummers, providing clear, resonant sound.",
    "subCategory": "Musical Toys"
  },
  {
    "toyId": 16, 
    "pictureURL": "https://i.ibb.co.com/sJQQPjCm/World-Globe.jpg",
    "toyName": "Interactive LED World Globe",
    "sellerName": "Global Learner",
    "sellerEmail": "global@example.com",
    "price": 39.99,
    "rating": 4.9,
    "availableQuantity": 55,
    "description": "This educational globe lights up with built-in LEDs and features a smart stylus that speaks information about countries, capitals, languages, and fun facts. It's a modern, engaging way for children to learn geography and world cultures. The durable base and clear political boundaries make it an excellent tool for school projects and home learning. Perfect for curious minds.",
    "subCategory": "Educational Toys"
  },
  {
    "toyId": 17, 
    "pictureURL": "https://i.ibb.co.com/7t06H2VR/Helicopter-with-Camera.jpg",
    "toyName": "RC Attack Helicopter with Camera",
    "sellerName": "Sky Patrol RC",
    "sellerEmail": "sky@example.com",
    "price": 85.50,
    "rating": 4.7,
    "availableQuantity": 30,
    "description": "Master the skies with this advanced remote-controlled attack helicopter. Featuring a stable gyroscope system for easy flying and a built-in HD camera for live video feed. The durable frame can withstand minor crashes, and the long-range controller ensures extended flying radius. Ideal for outdoor adventures and aerial photography enthusiasts.",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 18, 
    "pictureURL": "https://i.ibb.co.com/1t8nwCzN/Doctor-Kit.jpg",
    "toyName": "Pretend Play Doctor Kit (20 Pcs)",
    "sellerName": "Role Play Fun",
    "sellerEmail": "roleplay@example.com",
    "price": 17.99,
    "rating": 4.6,
    "availableQuantity": 105,
    "description": "A comprehensive 20-piece doctor kit that includes a stethoscope with realistic sounds, a thermometer, syringe, blood pressure cuff, and a sturdy carrying case. This toy helps children overcome fear of doctors, encourages empathy, and promotes imaginative role-playing scenarios. All pieces are made from non-toxic, safe plastic and are easy to clean.",
    "subCategory": "Creative Toys"
  },
  {
    "toyId": 19, 
    "pictureURL": "https://i.ibb.co.com/1YnHxSDp/Car-Model-Puzzle.jpg",
    "toyName": "3D Wooden Car Model Puzzle",
    "sellerName": "Wood Craft Puzzles",
    "sellerEmail": "wood@example.com",
    "price": 14.99,
    "rating": 4.8,
    "availableQuantity": 130,
    "description": "Construct a beautiful 3D model of a vintage car without glue or tools! This laser-cut wooden puzzle set contains precisely engineered pieces that lock together perfectly. It's a challenging and satisfying activity that enhances spatial awareness and concentration. The finished model serves as a great decorative piece, proudly displayed on a shelf.",
    "subCategory": "Puzzles"
  },
  {
    "toyId": 20, 
    "pictureURL": "https://i.ibb.co.com/1Ym4BVkD/Warrior-Doll.jpg",
    "toyName": "The Invincible Warrior Doll",
    "sellerName": "Hero Figures Inc.",
    "sellerEmail": "hero@example.com",
    "price": 19.50,
    "rating": 4.7,
    "availableQuantity": 95,
    "description": "An articulated 12-inch superhero figure with seven interchangeable hands and a highly detailed fabric costume. This figure allows children to recreate epic battle scenes and invent their own heroic stories. The sturdy construction and high-quality materials ensure it remains a formidable warrior throughout countless adventures. An inspirational toy for promoting bravery and justice.",
    "subCategory": "Dolls & Accessories"
  }
]

